#include"init.h"
#include "flashfunction.h"

extern unsigned char System_ID[6];
extern unsigned int DoorOpenTime;
/****************************************************/
/* 外部中断的初始化					                */
/* 程序功能：外部中断初始化，                       */
/* 入口参数:无										*/
/* 出口参数:无										*/
/****************************************************/
void INT_Init(void)
{
INT0=1;
IT0 = 0;                    //设置INT0的中断类型 (1:仅下降沿 0:上升沿和下降沿)
EX0 = 1;                    //使能INT0中断
}


/***************************************************/
/*函数名称：IO_Init	                               */
/*功    能：单片机IO端口模式初始化                 */
/*入口参数：无                                     */
/*返 回 值：无                                     */	
/*备    注：STC15W4K32S4系列A版单片机部分端口复位后*/
/*          不是准双向口,需要设置才能正常使用      */
/***************************************************/
void IO_Init(void)
{
//将P04 P05 P06 P07设置为开漏口
//因为单片机为5V端口，W25Q64为3.3V端口，为了实现电平匹配
//将单片机设置为开漏结构，由外部上拉到3.3V。
//	P4M1 |= BIT0; /*P4.0初始化为输入*/
//	P4M0 &= ~(BIT0);
//P4M0 |= (1<<0);
//P4M1 &= ~(1<<0);																			//P40初始化为输出
P4M0 &= ~(1<<3);
P4M1 &= ~(1<<3);
P4M0 &= ~(1<<4);
P4M1 &= ~(1<<4);																	 		//继电器端口初始化
P0M1 |= (1<<4) | (1<<5) | (1<<6) | (1<<7) ;  					//FLASH端口初始化
P0M0 |= (1<<4) | (1<<5) | (1<<6) | (1<<7) ;
P2M1 = 0xff;
P2M0 = 0x00;											//初始化P2为输入
P3M1 &= ~(1<<7);									//STB  P32初始化为输出  二维码模块复位引脚
P3M0 |= (1<<7);
P3M1 &= ~(1<<3);									//STB  P33初始化为输出
P3M0 |= (1<<3);
P1M1 &= ~(1<<4);									//REQ  P14初始化为输出
P1M0 |= (1<<4);	
P1M1 &= ~(1<<5);									//BUSYSTE  P15初始化为输出
P1M0 |= (1<<5);
P1M1 |= (1<<2);
P1M0 &= ~(1<<2);									//CHACK初始化为输入
P1M1 |= (1<<3);
P1M0 &= ~(1<<3);									//CHKREQ初始化为输入
//语音初始化
  P4M1 |=  (1<<2);		   //输入
  P4M0 &= ~(1<<2);

  P4M1 &= ~(1<<5);		   //输出
  P4M0 &= ~(1<<5);

REQ = 0;													//REQ默认没有请求数据
BUSYSTE = 0;											//BUSYSTE默认不忙
Door1_Ctl_0=1;Door1_Ctl_1=1;
}



/****************************************************/
/* 定时器0的初始化					                */
/* 程序功能：初始化定时器0，每隔10ms产生一次中断    */
/* 入口参数:无										*/
/* 出口参数:无										*/
/****************************************************/
void Timer0Init(void)		//10毫秒@22.1184MHz
{
	AUXR &= 0x7F;		//定时器时钟12T模式
	TMOD &= 0xF0;		//设置定时器模式
	TL0 = 0x00;		//设置定时初值
	TH0 = 0xB8;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	ET0=1; /*打开定时器中断*/
}

/*****************************************/
/* 串口1、4初始化													 */
/* 程序功能：串口1、4初始化								 */
/* 入口参数:无												   */
/* 出口参数:无												   */
/*****************************************/
void init_Uart(void)
{
P_SW2 &= ~0x04;            //S4_S0=0 (P0.2/RxD4, P0.3/TxD4)  
P_SW2 &= ~0x02;            //S3_S0=0 (P0.0/RxD3, P0.1/TxD3)
P_SW2 |=0x01;							/*设置串口2工作在P4.6和P4.7*/
ACC = P_SW1;
ACC &= ~(S1_S0 | S1_S1);    //S1_S0=0 S1_S1=0
P_SW1 = ACC;                //(P3.0/RxD, P3.1/TxD)
SCON = 0x50;								//1010000
S2CON = 0x50;               //8位可变波特率
S3CON = 0x50;
S4CON = 0x10;             	//00001010
T2L = (65536 - (FOSC/4/BAUD));   //设置波特率重装值
T2H = (65536 - (FOSC/4/BAUD))>>8;
	
    T3L = (65536 - (S3FOSC/4/S3BAUD));   //设置串口3波特率重装值
    T3H = (65536 - (S3FOSC/4/S3BAUD))>>8;
    T4T3M |= 0x02;              //定时器3为1T模式
    T4T3M |= 0x08;              //定时器3开始计时

AUXR = 0x14;								//T2为1T模式, 并启动定时器2 10100
AUXR |= 0x01;               //选择定时器2为串口1的波特率发生器
ES = 1;                     //使能串口1中断
IE2 = 0x19;                 //使能串口3,4中断
}

void System_SetParaInit(void){
	unsigned char i,TempBuffer[6];
	//读取系统编号
		FLASH_W25Q64_Read(TempBuffer,System_SetParaAddr, sizeof(System_ID));//读入缓冲区
		SBUF = 0x91;while(!(SCON&0x02));SCON &= ~0x02;
		for(i=0;i<6;i++){
	 SBUF = TempBuffer[i];while(!(SCON&0x02));SCON &= ~0x02;
	}
		if(TempBuffer[0] == 0xff){
		;
		}else{
		for(i=0;i<sizeof(System_ID);i++){
		System_ID[i] = TempBuffer[i];
		}
		}
		memset(TempBuffer,0x00,6);
		//读取开门时间设置
	FLASH_W25Q64_Read(TempBuffer,System_SetParaAddr+10, 2);//读入缓冲区
			if(TempBuffer[0] == 0xff){
		;
		}else{
		DoorOpenTime=TempBuffer[0]*256+TempBuffer[1];
		}
}

